marshallma21/AUTOSAR_SampleProject_MPC5748G/plugins/Mcu_TS_T2D35M10I0R0/include/Reg_eSys_MC_ME.h
/**
*   @file    Reg_eSys_MC_ME.h
*   @version 1.0.0
*
*   @brief   AUTOSAR Mcu - Macros for memory access.
*   @details Macros/Defines used for registry and memory read/write.
*
*   @addtogroup MCU
*   @{
*/
/*==================================================================================================
*   Project              : AUTOSAR 4.2 MCAL
*   Platform             : PA
*   Peripheral           : MC
*   Dependencies         : none
*
*   Autosar Version      : 4.2.2
*   Autosar Revision     : ASR_REL_4_2_REV_0002
*   Autosar Conf.Variant :
*   SW Version           : 1.0.0
*   Build Version        : MPC574XG_MCAL_1_0_0_RTM_ASR_REL_4_2_REV_0002_20170217
*
*   (c) Copyright 2006-2016 Freescale Semiconductor, Inc. 
*       Copyright 2017 NXP
*   All Rights Reserved.
==================================================================================================*/
/*==================================================================================================
==================================================================================================*/


#ifndef REG_ESYS_MC_ME_H
#define REG_ESYS_MC_ME_H


#ifdef __cplusplus
extern "C"{
#endif


/**
* @page misra_violations MISRA-C:2004 violations
*
* @section REG_ESYS_MC_ME_H_REF_1
* Violates MISRA 2004 Required Rule 1.4, The compiler/linker shall be checked to ensure that 31
* character significance and case sensitivity are supported for external identifiers
*
* @section [global]
* Violates MISRA 2004 Required Rule 5.1, Identifiers (internal and external) shall not rely
* on the significance of more than 31 characters. The used compilers use more than 31 chars for
* identifiers.
*/


/*==================================================================================================
                                         INCLUDE FILES
 1) system and project includes
 2) needed interfaces from external units
 3) internal and external interfaces from this unit
==================================================================================================*/
#include "Reg_eSys.h"
#include "Mcu_MC_IPVersion.h"

/*==================================================================================================
                               SOURCE FILE VERSION INFORMATION
==================================================================================================*/

#define REG_ESYS_MC_ME_VENDOR_ID                        43
/** @violates @ref REG_ESYS_MC_ME_H_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
#define REG_ESYS_MC_ME_AR_RELEASE_MAJOR_VERSION         4
/** @violates @ref REG_ESYS_MC_ME_H_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
#define REG_ESYS_MC_ME_AR_RELEASE_MINOR_VERSION         2
/** @violates @ref REG_ESYS_MC_ME_H_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
#define REG_ESYS_MC_ME_AR_RELEASE_REVISION_VERSION      2
#define REG_ESYS_MC_ME_SW_MAJOR_VERSION                 1
#define REG_ESYS_MC_ME_SW_MINOR_VERSION                 0
#define REG_ESYS_MC_ME_SW_PATCH_VERSION                 0


/*==================================================================================================
                                      FILE VERSION CHECKS
==================================================================================================*/
/* Check if current file and Reg_eSys header file are of the same version */
#ifndef DISABLE_MCAL_INTERMODULE_ASR_CHECK
    #if ((REG_ESYS_MC_ME_AR_RELEASE_MAJOR_VERSION != REG_ESYS_AR_RELEASE_MAJOR_VERSION) || \
         (REG_ESYS_MC_ME_AR_RELEASE_MINOR_VERSION != REG_ESYS_AR_RELEASE_MINOR_VERSION) \
        )
        #error "AutoSar Version Numbers of Reg_eSys_MC_ME.h and Reg_eSys.h are different"
    #endif
#endif

/* Check if source file and Mcu_MC_IPVersion header file are from the same vendor */
#if (REG_ESYS_MC_ME_VENDOR_ID != MCU_MC_IPVERSION_VENDOR_ID)
    #error "Reg_eSys_MC_ME.h and Mcu_MC_IPVersion.h have different vendor ids"
#endif
/* Check if source file and Mcu_MC_IPVersion header file are of the same Autosar version */
#if ((REG_ESYS_MC_ME_AR_RELEASE_MAJOR_VERSION != MCU_MC_IPVERSION_AR_RELEASE_MAJOR_VERSION) || \
     (REG_ESYS_MC_ME_AR_RELEASE_MINOR_VERSION != MCU_MC_IPVERSION_AR_RELEASE_MINOR_VERSION) || \
     (REG_ESYS_MC_ME_AR_RELEASE_REVISION_VERSION != MCU_MC_IPVERSION_AR_RELEASE_REVISION_VERSION) \
    )
    #error "AutoSar Version Numbers of Reg_eSys_MC_ME.h and Mcu_MC_IPVersion.h are different"
#endif
/* Check if source file and Mcu_MC_IPVersion header file are of the same Software version */
#if ((REG_ESYS_MC_ME_SW_MAJOR_VERSION != MCU_MC_IPVERSION_SW_MAJOR_VERSION) || \
     (REG_ESYS_MC_ME_SW_MINOR_VERSION != MCU_MC_IPVERSION_SW_MINOR_VERSION) || \
     (REG_ESYS_MC_ME_SW_PATCH_VERSION != MCU_MC_IPVERSION_SW_PATCH_VERSION) \
    )
    #error "Software Version Numbers of Reg_eSys_MC_ME.h and Mcu_MC_IPVersion.h are different"
#endif

/*==================================================================================================
*                                          CONSTANTS
==================================================================================================*/


/*==================================================================================================
                                       DEFINES AND MACROS
==================================================================================================*/

/* ME: Global Status Register Address. */
#define MC_ME_GS_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x0000U))
/* ME: Mode Control Register Address. */
#define MC_ME_MCTL_ADDR32                  ((uint32)(MC_ME_BASEADDR + (uint32)0x0004U))
/* ME: Mode Enable Register Address. */
#define MC_ME_ME_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x0008U))
/* ME: Interrupt Status Register Address. */
#define MC_ME_IS_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x000CU))
/* ME: Interrupt Mask Register Address. */
#define MC_ME_IM_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x0010U))
/* ME: Invalid Mode Transition Status Register Address. */
#define MC_ME_IMTS_ADDR32                   ((uint32)(MC_ME_BASEADDR + (uint32)0x0014U))
/* ME: Debug Mode Transition Status Register Address. */
#define MC_ME_DMTS_ADDR32                   ((uint32)(MC_ME_BASEADDR + (uint32)0x0018U))

/* ME: RESET Mode Configuration Register Address. */
#define MC_ME_RESET_MC_ADDR32               ((uint32)(MC_ME_BASEADDR + (uint32)0x0020U))
/* ME: TEST Mode Configuration Register Address. */
#define MC_ME_TEST_MC_ADDR32                ((uint32)(MC_ME_BASEADDR + (uint32)0x0024U))
/* ME: SAFE Mode Configuration Register Address. */
#define MC_ME_SAFE_MC_ADDR32                ((uint32)(MC_ME_BASEADDR + (uint32)0x0028U))
/* ME: DRUN Mode Configuration Register Address. */
#define MC_ME_DRUN_MC_ADDR32                ((uint32)(MC_ME_BASEADDR + (uint32)0x002CU))
/* ME: RUN0 Mode Configuration Registers Address. */
#define MC_ME_RUN0_MC_ADDR32                ((uint32)(MC_ME_BASEADDR + (uint32)0x0030U))
/* ME: RUN1 Mode Configuration Registers Address. */
#define MC_ME_RUN1_MC_ADDR32                ((uint32)(MC_ME_BASEADDR + (uint32)0x0034U))
/* ME: RUN2 Mode Configuration Registers Address. */
#define MC_ME_RUN2_MC_ADDR32                ((uint32)(MC_ME_BASEADDR + (uint32)0x0038U))
/* ME: RUN3 Mode Configuration Registers Address. */
#define MC_ME_RUN3_MC_ADDR32                ((uint32)(MC_ME_BASEADDR + (uint32)0x003CU))
/* ME: HALT0 Mode Configuration Register Address. */
#define MC_ME_HALT0_MC_ADDR32               ((uint32)(MC_ME_BASEADDR + (uint32)0x0040U))
/* ME: STOP0 Mode Configuration Register Address. */
#define MC_ME_STOP0_MC_ADDR32               ((uint32)(MC_ME_BASEADDR + (uint32)0x0048U))

#if ((IPV_MC == IPV_MC_05_00_00_10) || (IPV_MC == IPV_MC_05_00_00_07))
/* ME: STANDBY0 Mode Configuration Register Address. */
#define MC_ME_STBY0_MC_ADDR32               ((uint32)(MC_ME_BASEADDR + (uint32)0x0054U))
#endif

/* ME: Peripheral Status Register 0 Address. */
#define MC_ME_PS0_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x0060U))
/* ME: Peripheral Status Register 1 Address. */
#define MC_ME_PS1_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x0064U))
/* ME: Peripheral Status Register 2 Address. */
#define MC_ME_PS2_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x0068U))
/* ME: Peripheral Status Register 3 Address. */
#define MC_ME_PS3_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x006CU))
/* ME: Peripheral Status Register 4 Address. */
#define MC_ME_PS4_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x0070U))
/* ME: Peripheral Status Register 5 Address. */
#define MC_ME_PS5_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x0074U))
/* ME: Peripheral Status Register 6 Address. */
#define MC_ME_PS6_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x0078U))
/* ME: Peripheral Status Register 7 Address. */
#define MC_ME_PS7_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x007CU))

