marshallma21/AUTOSAR_SampleProject_MPC5748G/plugins/Mcu_TS_T2D35M10I0R0/include/Reg_eSys_MC_ME.h
/* ME: Run Peripheral Configuration 0 Register Address. */
#define MC_ME_RUN_PC0_ADDR32                ((uint32)(MC_ME_BASEADDR + (uint32)0x0080U))
/* ME: Run Peripheral Configuration 1 Register Address. */
#define MC_ME_RUN_PC1_ADDR32                ((uint32)(MC_ME_BASEADDR + (uint32)0x0084U))
/* ME: Run Peripheral Configuration 2 Register Address. */
#define MC_ME_RUN_PC2_ADDR32                ((uint32)(MC_ME_BASEADDR + (uint32)0x0088U))
/* ME: Run Peripheral Configuration 3 Register Address. */
#define MC_ME_RUN_PC3_ADDR32                ((uint32)(MC_ME_BASEADDR + (uint32)0x008CU))
/* ME: Run Peripheral Configuration 4 Register Address. */
#define MC_ME_RUN_PC4_ADDR32                ((uint32)(MC_ME_BASEADDR + (uint32)0x0090U))
/* ME: Run Peripheral Configuration 5 Register Address. */
#define MC_ME_RUN_PC5_ADDR32                ((uint32)(MC_ME_BASEADDR + (uint32)0x0094U))
/* ME: Run Peripheral Configuration 6 Register Address. */
#define MC_ME_RUN_PC6_ADDR32                ((uint32)(MC_ME_BASEADDR + (uint32)0x0098U))
/* ME: Run Peripheral Configuration 7 Register Address. */
#define MC_ME_RUN_PC7_ADDR32                ((uint32)(MC_ME_BASEADDR + (uint32)0x009CU))

/* ME: Low-Power Peripheral Configuration 0 Register Address. */
#define MC_ME_LP_PC0_ADDR32                 ((uint32)(MC_ME_BASEADDR + (uint32)0x00A0U))
/* ME: Low-Power Peripheral Configuration 1 Register Address. */
#define MC_ME_LP_PC1_ADDR32                 ((uint32)(MC_ME_BASEADDR + (uint32)0x00A4U))
/* ME: Low-Power Peripheral Configuration 2 Register Address. */
#define MC_ME_LP_PC2_ADDR32                 ((uint32)(MC_ME_BASEADDR + (uint32)0x00A8U))
/* ME: Low-Power Peripheral Configuration 3 Register Address. */
#define MC_ME_LP_PC3_ADDR32                 ((uint32)(MC_ME_BASEADDR + (uint32)0x00ACU))
/* ME: Low-Power Peripheral Configuration 4 Register Address. */
#define MC_ME_LP_PC4_ADDR32                 ((uint32)(MC_ME_BASEADDR + (uint32)0x00B0U))
/* ME: Low-Power Peripheral Configuration 5 Register Address. */
#define MC_ME_LP_PC5_ADDR32                 ((uint32)(MC_ME_BASEADDR + (uint32)0x00B4U))
/* ME: Low-Power Peripheral Configuration 6 Register Address. */
#define MC_ME_LP_PC6_ADDR32                 ((uint32)(MC_ME_BASEADDR + (uint32)0x00B8U))
/* ME: Low-Power Peripheral Configuration 7 Register Address. */
#define MC_ME_LP_PC7_ADDR32                 ((uint32)(MC_ME_BASEADDR + (uint32)0x00BCU))

#if (IPV_MC == IPV_MC_05_00_00_10)
    /* MCV5 */
    #define MC_ME_PCTL3_ADDR32                      ((uint32)(MC_ME_BASEADDR + (uint32)0x00C0U))
    #define MC_ME_PCTL2_ADDR32                      ((uint32)(MC_ME_BASEADDR + (uint32)0x00C1U))
    #define MC_ME_PCTL1_ADDR32                      ((uint32)(MC_ME_BASEADDR + (uint32)0x00C2U))

    #define MC_ME_PCTL7_ADDR32                      ((uint32)(MC_ME_BASEADDR + (uint32)0x00C4U))
    #define MC_ME_PCTL6_ADDR32                      ((uint32)(MC_ME_BASEADDR + (uint32)0x00C5U))
    #define MC_ME_PCTL5_ADDR32                      ((uint32)(MC_ME_BASEADDR + (uint32)0x00C6U))
    #define MC_ME_PCTL4_ADDR32                      ((uint32)(MC_ME_BASEADDR + (uint32)0x00C7U))

    #define MC_ME_PCTL11_ADDR32                     ((uint32)(MC_ME_BASEADDR + (uint32)0x00C8U))
    #define MC_ME_PCTL10_ADDR32                     ((uint32)(MC_ME_BASEADDR + (uint32)0x00C9U))
    #define MC_ME_PCTL9_ADDR32                      ((uint32)(MC_ME_BASEADDR + (uint32)0x00CAU))

    #define MC_ME_PCTL15_ADDR32                     ((uint32)(MC_ME_BASEADDR + (uint32)0x00CCU))
    #define MC_ME_PCTL14_ADDR32                     ((uint32)(MC_ME_BASEADDR + (uint32)0x00CDU))
    #define MC_ME_PCTL13_ADDR32                     ((uint32)(MC_ME_BASEADDR + (uint32)0x00CEU))
    #define MC_ME_PCTL12_ADDR32                     ((uint32)(MC_ME_BASEADDR + (uint32)0x00CFU))

    #define MC_ME_PCTL19_ADDR32                     ((uint32)(MC_ME_BASEADDR + (uint32)0x00D0U))
    #define MC_ME_PCTL18_ADDR32                     ((uint32)(MC_ME_BASEADDR + (uint32)0x00D1U))
    #define MC_ME_PCTL17_ADDR32                     ((uint32)(MC_ME_BASEADDR + (uint32)0x00D2U))
    #define MC_ME_PCTL16_ADDR32                     ((uint32)(MC_ME_BASEADDR + (uint32)0x00D3U))

    #define MC_ME_PCTL23_ADDR32                     ((uint32)(MC_ME_BASEADDR + (uint32)0x00D4U))
    #define MC_ME_PCTL22_ADDR32                     ((uint32)(MC_ME_BASEADDR + (uint32)0x00D5U))
    #define MC_ME_PCTL21_ADDR32                     ((uint32)(MC_ME_BASEADDR + (uint32)0x00D6U))
    #define MC_ME_PCTL20_ADDR32                     ((uint32)(MC_ME_BASEADDR + (uint32)0x00D7U))

    #define MC_ME_PCTL27_ADDR32                     ((uint32)(MC_ME_BASEADDR + (uint32)0x00D8U))
    #define MC_ME_PCTL26_ADDR32                     ((uint32)(MC_ME_BASEADDR + (uint32)0x00D9U))
    #define MC_ME_PCTL25_ADDR32                     ((uint32)(MC_ME_BASEADDR + (uint32)0x00DAU))
    #define MC_ME_PCTL24_ADDR32                     ((uint32)(MC_ME_BASEADDR + (uint32)0x00DBU))

    #define MC_ME_PCTL30_ADDR32                     ((uint32)(MC_ME_BASEADDR + (uint32)0x00DDU))
    #define MC_ME_PCTL29_ADDR32                     ((uint32)(MC_ME_BASEADDR + (uint32)0x00DEU))
    #define MC_ME_PCTL28_ADDR32                     ((uint32)(MC_ME_BASEADDR + (uint32)0x00DFU))

    #define MC_ME_PCTL35_ADDR32                     ((uint32)(MC_ME_BASEADDR + (uint32)0x00E0U))
    #define MC_ME_PCTL34_ADDR32                     ((uint32)(MC_ME_BASEADDR + (uint32)0x00E1U))

    #define MC_ME_PCTL36_ADDR32                     ((uint32)(MC_ME_BASEADDR + (uint32)0x00E7U))

    #define MC_ME_PCTL60_ADDR32                     ((uint32)(MC_ME_BASEADDR + (uint32)0x00FFU))

    #define MC_ME_PCTL84_ADDR32                     ((uint32)(MC_ME_BASEADDR + (uint32)0x0117U))

    #define MC_ME_PCTL88_ADDR32                     ((uint32)(MC_ME_BASEADDR + (uint32)0x011BU))

    #define MC_ME_PCTL129_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x0142U))
    #define MC_ME_PCTL128_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x0143U))

    #define MC_ME_PCTL132_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x0147U))

    #define MC_ME_PCTL136_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x014BU))

    #define MC_ME_PCTL152_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x015BU))

    #define MC_ME_PCTL168_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x016BU))

