marshallma21/AUTOSAR_SampleProject_MPC5748G/plugins/Mcu_TS_T2D35M10I0R0/include/Reg_eSys_MC_ME.h
    #define MC_ME_PCTL172_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x016FU))

    #define MC_ME_PCTL176_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x0173U))

    #define MC_ME_PCTL180_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x0177U))

    #define MC_ME_PCTL184_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x017BU))

    #define MC_ME_PCTL188_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x017FU))

    #define MC_ME_PCTL193_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x0182U))
    
    #define MC_ME_PCTL192_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x0183U))

    #define MC_ME_PCTL196_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x0187U))

    #define MC_ME_PCTL200_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x018BU))

    #define MC_ME_PCTL204_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x018FU))
    
#elif (IPV_MC == IPV_MC_06_00_00_10)

    #define MC_ME_PCTL39_ADDR32                     ((uint32)(MC_ME_BASEADDR + (uint32)0x00E4U))
    #define MC_ME_PCTL40_ADDR32                     ((uint32)(MC_ME_BASEADDR + (uint32)0x00EBU))
    
    #define MC_ME_PCTL48_ADDR32                     ((uint32)(MC_ME_BASEADDR + (uint32)0x00F3U))
    #define MC_ME_PCTL49_ADDR32                     ((uint32)(MC_ME_BASEADDR + (uint32)0x00F2U))
    #define MC_ME_PCTL50_ADDR32                     ((uint32)(MC_ME_BASEADDR + (uint32)0x00F1U))
    
    #define MC_ME_PCTL52_ADDR32                     ((uint32)(MC_ME_BASEADDR + (uint32)0x00F7U))
    #define MC_ME_PCTL54_ADDR32                     ((uint32)(MC_ME_BASEADDR + (uint32)0x00F5U))
    
    #define MC_ME_PCTL58_ADDR32                     ((uint32)(MC_ME_BASEADDR + (uint32)0x00F9U))
    #define MC_ME_PCTL77_ADDR32                     ((uint32)(MC_ME_BASEADDR + (uint32)0x010EU))
    #define MC_ME_PCTL79_ADDR32                     ((uint32)(MC_ME_BASEADDR + (uint32)0x010CU))

    #define MC_ME_PCTL81_ADDR32                     ((uint32)(MC_ME_BASEADDR + (uint32)0x0112U))
    #define MC_ME_PCTL83_ADDR32                     ((uint32)(MC_ME_BASEADDR + (uint32)0x0110U))
    #define MC_ME_PCTL85_ADDR32                     ((uint32)(MC_ME_BASEADDR + (uint32)0x0116U))
    #define MC_ME_PCTL87_ADDR32                     ((uint32)(MC_ME_BASEADDR + (uint32)0x0114U))
    
    #define MC_ME_PCTL89_ADDR32                     ((uint32)(MC_ME_BASEADDR + (uint32)0x011AU))
    #define MC_ME_PCTL91_ADDR32                     ((uint32)(MC_ME_BASEADDR + (uint32)0x0118U))
    #define MC_ME_PCTL93_ADDR32                     ((uint32)(MC_ME_BASEADDR + (uint32)0x011EU))

    #define MC_ME_PCTL100_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x0127U))
    #define MC_ME_PCTL104_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x012BU))
    
    #define MC_ME_PCTL116_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x0137U))
    #define MC_ME_PCTL120_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x013BU))
    #define MC_ME_PCTL160_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x0163U))
    #define MC_ME_PCTL161_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x0162U))
    #define MC_ME_PCTL162_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x0161U))
    #define MC_ME_PCTL166_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x0165U))
    #define MC_ME_PCTL170_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x0169U))
    #define MC_ME_PCTL182_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x0175U))
    
    #define MC_ME_PCTL184_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x017BU))
    #define MC_ME_PCTL186_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x0179U))
    #define MC_ME_PCTL188_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x017FU))
    
    #define MC_ME_PCTL190_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x017DU))
    #define MC_ME_PCTL192_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x0183U))
    #define MC_ME_PCTL194_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x0181U))
    
    #define MC_ME_PCTL204_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x018FU))
    #define MC_ME_PCTL206_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x018DU))
    #define MC_ME_PCTL208_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x0193U))
    
    #define MC_ME_PCTL212_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x0197U))
    #define MC_ME_PCTL216_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x019BU))
    #define MC_ME_PCTL220_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x019FU))
    #define MC_ME_PCTL236_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x01AFU))

#else
    /* MCV4 */
    #define MC_ME_PCTL0_ADDR32                      ((uint32)(MC_ME_BASEADDR + (uint32)0x00C0U))
    #define MC_ME_PCTL1_ADDR32                      ((uint32)(MC_ME_BASEADDR + (uint32)0x00C1U))
    #define MC_ME_PCTL2_ADDR32                      ((uint32)(MC_ME_BASEADDR + (uint32)0x00C2U))
    #define MC_ME_PCTL3_ADDR32                      ((uint32)(MC_ME_BASEADDR + (uint32)0x00C3U))
    #define MC_ME_PCTL4_ADDR32                      ((uint32)(MC_ME_BASEADDR + (uint32)0x00C4U))
    #define MC_ME_PCTL5_ADDR32                      ((uint32)(MC_ME_BASEADDR + (uint32)0x00C5U))
    #define MC_ME_PCTL6_ADDR32                      ((uint32)(MC_ME_BASEADDR + (uint32)0x00C6U))
    #define MC_ME_PCTL7_ADDR32                      ((uint32)(MC_ME_BASEADDR + (uint32)0x00C7U))
    /* LFAST_0 Peripheral Control Register */
    #define MC_ME_PCTL9_ADDR32                      ((uint32)(MC_ME_BASEADDR + (uint32)0x00C9U))
    #define MC_ME_PCTL10_ADDR32                      ((uint32)(MC_ME_BASEADDR + (uint32)0x00CAU))

