marshallma21/AUTOSAR_SampleProject_MPC5748G/plugins/Mcu_TS_T2D35M10I0R0/include/Reg_eSys_MC_ME.h
    #define MC_ME_PCTL11_ADDR32                     ((uint32)(MC_ME_BASEADDR + (uint32)0x00CBU))
    #define MC_ME_PCTL12_ADDR32                     ((uint32)(MC_ME_BASEADDR + (uint32)0x00CCU))
    #define MC_ME_PCTL15_ADDR32                     ((uint32)(MC_ME_BASEADDR + (uint32)0x00CFU))
    #define MC_ME_PCTL20_ADDR32                     ((uint32)(MC_ME_BASEADDR + (uint32)0x00D4U))
    #define MC_ME_PCTL21_ADDR32                     ((uint32)(MC_ME_BASEADDR + (uint32)0x00D5U))
    #define MC_ME_PCTL22_ADDR32                     ((uint32)(MC_ME_BASEADDR + (uint32)0x00D6U))
    #define MC_ME_PCTL23_ADDR32                     ((uint32)(MC_ME_BASEADDR + (uint32)0x00D7U))
    #define MC_ME_PCTL24_ADDR32                     ((uint32)(MC_ME_BASEADDR + (uint32)0x00D8U))
    #define MC_ME_PCTL25_ADDR32                     ((uint32)(MC_ME_BASEADDR + (uint32)0x00D9U))

    #define MC_ME_PCTL28_ADDR32                     ((uint32)(MC_ME_BASEADDR + (uint32)0x00DCU))
    #define MC_ME_PCTL29_ADDR32                     ((uint32)(MC_ME_BASEADDR + (uint32)0x00DDU))

    #define MC_ME_PCTL30_ADDR32                     ((uint32)(MC_ME_BASEADDR + (uint32)0x00DEU))
    #define MC_ME_PCTL31_ADDR32                     ((uint32)(MC_ME_BASEADDR + (uint32)0x00DFU))
    #define MC_ME_PCTL32_ADDR32                     ((uint32)(MC_ME_BASEADDR + (uint32)0x00E0U))
    #define MC_ME_PCTL33_ADDR32                     ((uint32)(MC_ME_BASEADDR + (uint32)0x00E1U))
    /* ATX Peripheral Control Register (MC_ME_PCTL34) */
    #define MC_ME_PCTL34_ADDR32                     ((uint32)(MC_ME_BASEADDR + (uint32)0x00E2U))
    /* DMAMUX_0 Peripheral Control Register (MC_ME_PCTL36) */
    #define MC_ME_PCTL36_ADDR32                     ((uint32)(MC_ME_BASEADDR + (uint32)0x00E4U))
    /* CRC_0 Peripheral Control Register (MC_ME_PCTL38) */
    #define MC_ME_PCTL38_ADDR32                     ((uint32)(MC_ME_BASEADDR + (uint32)0x00E6U))
    
    #define MC_ME_PCTL40_ADDR32                     ((uint32)(MC_ME_BASEADDR + (uint32)0x00E8U))
    #define MC_ME_PCTL41_ADDR32                     ((uint32)(MC_ME_BASEADDR + (uint32)0x00E9U))
    #define MC_ME_PCTL42_ADDR32                     ((uint32)(MC_ME_BASEADDR + (uint32)0x00EAU))
    #define MC_ME_PCTL43_ADDR32                     ((uint32)(MC_ME_BASEADDR + (uint32)0x00EBU))

    #define MC_ME_PCTL45_ADDR32                     ((uint32)(MC_ME_BASEADDR + (uint32)0x00EDU))
    #define MC_ME_PCTL49_ADDR32                     ((uint32)(MC_ME_BASEADDR + (uint32)0x00F1U))

    #define MC_ME_PCTL50_ADDR32                     ((uint32)(MC_ME_BASEADDR + (uint32)0x00F2U))
    #define MC_ME_PCTL51_ADDR32                     ((uint32)(MC_ME_BASEADDR + (uint32)0x00F3U))
    #define MC_ME_PCTL52_ADDR32                     ((uint32)(MC_ME_BASEADDR + (uint32)0x00F4U))
    #define MC_ME_PCTL53_ADDR32                     ((uint32)(MC_ME_BASEADDR + (uint32)0x00F5U))
    #define MC_ME_PCTL54_ADDR32                     ((uint32)(MC_ME_BASEADDR + (uint32)0x00F6U))

    #define MC_ME_PCTL55_ADDR32                     ((uint32)(MC_ME_BASEADDR + (uint32)0x00F7U))
    #define MC_ME_PCTL56_ADDR32                     ((uint32)(MC_ME_BASEADDR + (uint32)0x00F8U))
    #define MC_ME_PCTL57_ADDR32                     ((uint32)(MC_ME_BASEADDR + (uint32)0x00F9U))
    #define MC_ME_PCTL58_ADDR32                     ((uint32)(MC_ME_BASEADDR + (uint32)0x00FAU))
    #define MC_ME_PCTL59_ADDR32                     ((uint32)(MC_ME_BASEADDR + (uint32)0x00FBU))
    #define MC_ME_PCTL60_ADDR32                     ((uint32)(MC_ME_BASEADDR + (uint32)0x00FCU))

    #define MC_ME_PCTL61_ADDR32                     ((uint32)(MC_ME_BASEADDR + (uint32)0x00FDU))
    #define MC_ME_PCTL62_ADDR32                     ((uint32)(MC_ME_BASEADDR + (uint32)0x00FEU))
    #define MC_ME_PCTL63_ADDR32                     ((uint32)(MC_ME_BASEADDR + (uint32)0x00FFU))
    #define MC_ME_PCTL64_ADDR32                     ((uint32)(MC_ME_BASEADDR + (uint32)0x0100U))
    #define MC_ME_PCTL65_ADDR32                     ((uint32)(MC_ME_BASEADDR + (uint32)0x0101U))
    #define MC_ME_PCTL66_ADDR32                     ((uint32)(MC_ME_BASEADDR + (uint32)0x0102U))

    #define MC_ME_PCTL67_ADDR32                     ((uint32)(MC_ME_BASEADDR + (uint32)0x0103U))
    #define MC_ME_PCTL68_ADDR32                     ((uint32)(MC_ME_BASEADDR + (uint32)0x0104U))
    #define MC_ME_PCTL69_ADDR32                     ((uint32)(MC_ME_BASEADDR + (uint32)0x0105U))
    #define MC_ME_PCTL70_ADDR32                     ((uint32)(MC_ME_BASEADDR + (uint32)0x0106U))
    #define MC_ME_PCTL71_ADDR32                     ((uint32)(MC_ME_BASEADDR + (uint32)0x0107U))
    #define MC_ME_PCTL72_ADDR32                     ((uint32)(MC_ME_BASEADDR + (uint32)0x0108U))
    #define MC_ME_PCTL73_ADDR32                     ((uint32)(MC_ME_BASEADDR + (uint32)0x0109U))
    #define MC_ME_PCTL74_ADDR32                     ((uint32)(MC_ME_BASEADDR + (uint32)0x010AU))
    #define MC_ME_PCTL75_ADDR32                     ((uint32)(MC_ME_BASEADDR + (uint32)0x010BU))
    #define MC_ME_PCTL76_ADDR32                     ((uint32)(MC_ME_BASEADDR + (uint32)0x010CU))

    #define MC_ME_PCTL77_ADDR32                     ((uint32)(MC_ME_BASEADDR + (uint32)0x010DU))
    /* CAN_1 Peripheral Control Register (MC_ME_PCTL78) */
    #define MC_ME_PCTL78_ADDR32                     ((uint32)(MC_ME_BASEADDR + (uint32)0x010EU))
    /* CAN_0 Peripheral Control Register (MC_ME_PCTL79) */
    #define MC_ME_PCTL79_ADDR32                     ((uint32)(MC_ME_BASEADDR + (uint32)0x010FU))
    #define MC_ME_PCTL81_ADDR32                     ((uint32)(MC_ME_BASEADDR + (uint32)0x0111U))
    #define MC_ME_PCTL82_ADDR32                     ((uint32)(MC_ME_BASEADDR + (uint32)0x0112U))
    #define MC_ME_PCTL83_ADDR32                     ((uint32)(MC_ME_BASEADDR + (uint32)0x0113U))
    #define MC_ME_PCTL84_ADDR32                     ((uint32)(MC_ME_BASEADDR + (uint32)0x0114U))
    #define MC_ME_PCTL85_ADDR32                     ((uint32)(MC_ME_BASEADDR + (uint32)0x0115U))
    
