marshallma21/AUTOSAR_SampleProject_MPC5748G/plugins/Mcu_TS_T2D35M10I0R0/include/Reg_eSys_MC_ME.h
    #define MC_ME_PCTL87_ADDR32                     ((uint32)(MC_ME_BASEADDR + (uint32)0x0117U))
    
    #define MC_ME_PCTL89_ADDR32                     ((uint32)(MC_ME_BASEADDR + (uint32)0x0119U))    
    #define MC_ME_PCTL90_ADDR32                     ((uint32)(MC_ME_BASEADDR + (uint32)0x011AU))

    #define MC_ME_PCTL91_ADDR32                     ((uint32)(MC_ME_BASEADDR + (uint32)0x011BU))
    #define MC_ME_PCTL92_ADDR32                     ((uint32)(MC_ME_BASEADDR + (uint32)0x011CU))
    #define MC_ME_PCTL93_ADDR32                     ((uint32)(MC_ME_BASEADDR + (uint32)0x011DU))
    #define MC_ME_PCTL96_ADDR32                     ((uint32)(MC_ME_BASEADDR + (uint32)0x0120U))
    #define MC_ME_PCTL97_ADDR32                     ((uint32)(MC_ME_BASEADDR + (uint32)0x0121U))

    #define MC_ME_PCTL98_ADDR32                     ((uint32)(MC_ME_BASEADDR + (uint32)0x0122U))

    #define MC_ME_PCTL99_ADDR32                     ((uint32)(MC_ME_BASEADDR + (uint32)0x0123U))
    #define MC_ME_PCTL100_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x0124U))
    #define MC_ME_PCTL101_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x0125U))
    #define MC_ME_PCTL102_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x0126U))
    /* SENT_0 Peripheral Control Register (MC_ME_PCTL104) */
    #define MC_ME_PCTL104_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x0128U))
    #define MC_ME_PCTL105_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x0129U))
    /* FLEXRAY Peripheral Control Register (MC_ME_PCTL107) */
    #define MC_ME_PCTL107_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x012BU))
    #define MC_ME_PCTL111_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x012FU))
    #define MC_ME_PCTL112_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x0130U))
    
    #define MC_ME_PCTL116_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x0134U))
    #define MC_ME_PCTL120_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x0138U))
    
    #define MC_ME_PCTL123_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x013BU))
    /* ADC_3 Peripheral Control Register (MC_ME_PCTL124) */
    #define MC_ME_PCTL124_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x013CU))
    /* ADC_1 Peripheral Control Register (MC_ME_PCTL126) */
    #define MC_ME_PCTL126_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x013EU))
    #define MC_ME_PCTL127_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x013FU))
    #define MC_ME_PCTL128_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x0140U))
    /* ETIMER_1 Peripheral Control Register (MC_ME_PCTL137) */
    #define MC_ME_PCTL137_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x0149U))
    /* CTU_1 Peripheral Control Register (MC_ME_PCTL141) */
    #define MC_ME_PCTL141_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x014DU))
    #define MC_ME_PCTL143_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x014FU))
    /* PWM_1 Peripheral Control Register (MC_ME_PCTL144) */
    #define MC_ME_PCTL144_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x0150U))
    /* DMAMUX_1 Peripheral Control Register (MC_ME_PCTL146) */
    #define MC_ME_PCTL146_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x0152U))
    #define MC_ME_PCTL148_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x0154U))
    #define MC_ME_PCTL149_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x0155U))
    
    #define MC_ME_PCTL152_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x0158U))
    #define MC_ME_PCTL154_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x015AU))
    #define MC_ME_PCTL158_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x015EU))
    
    #define MC_ME_PCTL161_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x0161U))
    #define MC_ME_PCTL162_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x0162U))
    #define MC_ME_PCTL166_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x0166U))
    
    #define MC_ME_PCTL170_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x016AU))
    #define MC_ME_PCTL177_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x0171U))
    #define MC_ME_PCTL179_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x0173U))
    #define MC_ME_PCTL180_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x0174U))
    #define MC_ME_PCTL181_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x0175U))
    #define MC_ME_PCTL182_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x0176U))
    #define MC_ME_PCTL183_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x0177U))
    #define MC_ME_PCTL184_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x0178U))
    #define MC_ME_PCTL185_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x0179U))
    #define MC_ME_PCTL186_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x017AU))
    #define MC_ME_PCTL187_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x017BU))
    #define MC_ME_PCTL188_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x017CU))
    #define MC_ME_PCTL189_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x017DU))
    #define MC_ME_PCTL190_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x017EU))
    #define MC_ME_PCTL191_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x017FU))
    #define MC_ME_PCTL192_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x0180U))
    #define MC_ME_PCTL193_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x0181U))
    #define MC_ME_PCTL194_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x0182U))
    
    #define MC_ME_PCTL196_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x0184U))
    #define MC_ME_PCTL197_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x0185U))
    #define MC_ME_PCTL198_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x0186U))
    
    #define MC_ME_PCTL200_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x0188U))
    
    #define MC_ME_PCTL202_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x018AU))
    #define MC_ME_PCTL203_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x018BU))
    /* LINFlex_0 Peripheral Control Register (MC_ME_PCTL204) */
    #define MC_ME_PCTL204_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x018CU))
    #define MC_ME_PCTL205_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x018DU))
    #define MC_ME_PCTL206_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x018EU))
    #define MC_ME_PCTL207_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x018FU))
    /* DSPI_3 Peripheral Control Register (MC_ME_PCTL208) */
    #define MC_ME_PCTL208_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x0190U))
    /* DSPI_2 Peripheral Control Register (MC_ME_PCTL209) */
    #define MC_ME_PCTL209_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x0191U))
    #define MC_ME_PCTL210_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x0192U))
    #define MC_ME_PCTL213_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x0195U))
    /* SENT_1 Peripheral Control Register (MC_ME_PCTL214) */
    #define MC_ME_PCTL214_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x0196U))
    
    #define MC_ME_PCTL216_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x0198U))
    
    #define MC_ME_PCTL219_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x019BU))
    #define MC_ME_PCTL220_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x019CU))
    #define MC_ME_PCTL225_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x01A1U))
    #define MC_ME_PCTL226_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x01A2U))
    #define MC_ME_PCTL227_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x01A3U))
    #define MC_ME_PCTL229_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x01A5U))
    #define MC_ME_PCTL230_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x01A6U))
    #define MC_ME_PCTL232_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x01A8U))
    /* ADC_2 Peripheral Control Register (MC_ME_PCTL235) */
    #define MC_ME_PCTL235_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x01ABU))
    /* ADC_0 Peripheral Control Register (MC_ME_PCTL237) */
    #define MC_ME_PCTL237_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x01ADU))
    #define MC_ME_PCTL238_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x01AEU))
    /* SWG_0 Peripheral Control Register (MC_ME_PCTL239) */
    #define MC_ME_PCTL239_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x01AFU))
    /* ETIMER_2 Peripheral Control Register (MC_ME_PCTL245) */
    #define MC_ME_PCTL245_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x01B5U))
    #define MC_ME_PCTL246_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x01B6U))
    /* ETIMER_0 Peripheral Control Register (MC_ME_PCTL247) */
    #define MC_ME_PCTL247_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x01B7U))
    #define MC_ME_PCTL248_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x01B8U))
    #define MC_ME_PCTL249_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x01B9U))
    #define MC_ME_PCTL250_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x01BAU))
    /* CTU_0 Peripheral Control Register (MC_ME_PCTL251) */
    #define MC_ME_PCTL251_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x01BBU))
    #define MC_ME_PCTL252_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x01BCU))
    #define MC_ME_PCTL253_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x01BDU))
    #define MC_ME_PCTL254_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x01BEU))
    /* PWM_0 Peripheral Control Register (MC_ME_PCTL255) */
    #define MC_ME_PCTL255_ADDR32                    ((uint32)(MC_ME_BASEADDR + (uint32)0x01BFU))
#endif

