marshallma21/AUTOSAR_SampleProject_MPC5748G/plugins/Mcu_TS_T2D35M10I0R0/include/Reg_eSys_MC_ME.h
/************************************/
/* Core Control Register (ME_CCTLn) */
/************************************/

#if (IPV_MC == IPV_MC_06_00_00_10)
    #define MC_ME_CCTL0_ADDR32                          ((uint32)(MC_ME_BASEADDR + (uint32)0x01C6U))
    #define MC_ME_CCTL1_ADDR32                          ((uint32)(MC_ME_BASEADDR + (uint32)0x01C4U))
#else
    #define MC_ME_CCTL0_ADDR32                          ((uint32)(MC_ME_BASEADDR + (uint32)0x01C4U))
    #define MC_ME_CCTL1_ADDR32                          ((uint32)(MC_ME_BASEADDR + (uint32)0x01C6U))
#endif

#if (IPV_MC == IPV_MC_05_00_00_10)
    #define MC_ME_CCTL2_ADDR32                          ((uint32)(MC_ME_BASEADDR + (uint32)0x01CAU))
#elif (IPV_MC == IPV_MC_06_00_00_10)
    #define MC_ME_CCTL2_ADDR32                          ((uint32)(MC_ME_BASEADDR + (uint32)0x01CAU))
#else
    #define MC_ME_CCTL2_ADDR32                          ((uint32)(MC_ME_BASEADDR + (uint32)0x01C8U))
#endif

#if (IPV_MC == IPV_MC_06_00_00_10)
    #define MC_ME_CCTL3_ADDR32                          ((uint32)(MC_ME_BASEADDR + (uint32)0x01C8U))
    #define MC_ME_CCTL4_ADDR32                          ((uint32)(MC_ME_BASEADDR + (uint32)0x01CEU))
#else
    #define MC_ME_CCTL3_ADDR32                          ((uint32)(MC_ME_BASEADDR + (uint32)0x01CAU))
    #define MC_ME_CCTL4_ADDR32                          ((uint32)(MC_ME_BASEADDR + (uint32)0x01CCU))
#endif

/**************************************/
/* Core Address Register (ME_CADDRn)  */
/**************************************/
#define MC_ME_CADDR0_ADDR32                         ((uint32)(MC_ME_BASEADDR + (uint32)0x01E0U))
#define MC_ME_CADDR1_ADDR32                         ((uint32)(MC_ME_BASEADDR + (uint32)0x01E4U))
#define MC_ME_CADDR2_ADDR32                         ((uint32)(MC_ME_BASEADDR + (uint32)0x01E8U))
#define MC_ME_CADDR3_ADDR32                         ((uint32)(MC_ME_BASEADDR + (uint32)0x01ECU))
#define MC_ME_CADDR4_ADDR32                         ((uint32)(MC_ME_BASEADDR + (uint32)0x01F0U))

#define MC_ME_TEST_SEC_CC_I_ADDR32                  ((uint32)(MC_ME_BASEADDR + (uint32)0x00000240U))
#define MC_ME_DRUN_SEC_CC_I_ADDR32                  ((uint32)(MC_ME_BASEADDR + (uint32)0x00000260U))
#define MC_ME_RUN0_SEC_CC_I_ADDR32                  ((uint32)(MC_ME_BASEADDR + (uint32)0x00000270U))
#define MC_ME_RUN1_SEC_CC_I_ADDR32                  ((uint32)(MC_ME_BASEADDR + (uint32)0x00000280U))
#define MC_ME_RUN2_SEC_CC_I_ADDR32                  ((uint32)(MC_ME_BASEADDR + (uint32)0x00000290U))
#define MC_ME_RUN3_SEC_CC_I_ADDR32                  ((uint32)(MC_ME_BASEADDR + (uint32)0x000002A0U))

/*************************************/
/*  GPR SLEEP Register (GPR_SLEEP)   */
/*************************************/
#if ((IPV_MC == IPV_MC_05_00_00_07))

#ifdef MCU_ERR009139_IPV_MC_05000007
#if (MCU_ERR009139_IPV_MC_05000007 == STD_ON)
/* ME:  GPR SLEEP Register Address. */
#define MC_ME_GPR_SLEEP_ADDR32              ((uint32)0xFFF94014U)
#endif  /* MCU_ERR009139_IPV_MC_05000007 */
#endif  /* (MCU_ERR009139_IPV_MC_05000007 == STD_ON) */

#endif

/*************************************/
/* Global Status Register (MC_ME_GS) */
/*************************************/
/* bit masks */
#define MC_ME_GS_S_CURRENT_MODE_MASK32              ((uint32)0xF0000000U)
#define MC_ME_GS_S_MTRANS_MASK32                    ((uint32)0x08000000U)
#define MC_ME_GS_S_SYSCLK_MASK32                    ((uint32)0x0000000FU)
#define MC_ME_GS_S_PDO_MASK32                       ((uint32)0x00800000U)
#define MC_ME_GS_S_MVR_MASK32                       ((uint32)0x00100000U)
#define MC_ME_GS_S_FLA_MASK32                       ((uint32)0x00030000U)
/* clock sources status */
#if ((IPV_MC == IPV_MC_04_03_00_00) || (IPV_MC == IPV_MC_04_06_05_00))
    #define MC_ME_GS_S_SDPLL_MASK32                 ((uint32)0x00000100U)
#endif /* IPV_MC_04_03_00_00 */

#if ((IPV_MC == IPV_MC_04_04_01_00) || (IPV_MC == IPV_MC_04_03_00_00) ||\
     (IPV_MC == IPV_MC_04_00_15_15) || (IPV_MC == IPV_MC_04_01_00_00) ||\
     (IPV_MC == IPV_MC_04_06_01_00) || (IPV_MC == IPV_MC_04_06_05_00) \
    )
    #define MC_ME_GS_S_PLL1_MASK32                  ((uint32)0x00000080U)
    #define MC_ME_GS_S_PLL0_MASK32                  ((uint32)0x00000040U)
    #define MC_ME_GS_S_XOSC_MASK32                  ((uint32)0x00000020U)
    #define MC_ME_GS_S_IRCOSC_MASK32                ((uint32)0x00000010U)
#endif /* ((IPV_MC == IPV_MC_04_04_01_00)  ... */

#if (IPV_MC == IPV_MC_05_00_00_10)
    #define MC_ME_GS_S_PLL3_MASK32                  ((uint32)0x00000800U)
    #define MC_ME_GS_S_PLL2_MASK32                  ((uint32)0x00000400U)
    #define MC_ME_GS_S_PLL1_MASK32                  ((uint32)0x00000200U)
    #define MC_ME_GS_S_PLL0_MASK32                  ((uint32)0x00000100U)
    #define MC_ME_GS_S_SXOSC_MASK32                 ((uint32)0x00000080U)
    #define MC_ME_GS_S_SIRC_MASK32                  ((uint32)0x00000040U)
    #define MC_ME_GS_S_FXOSC_MASK32                 ((uint32)0x00000020U)
    #define MC_ME_GS_S_FIRC_MASK32                  ((uint32)0x00000010U)
#endif /* (IPV_MC == IPV_MC_05_00_00_10) */

#if (IPV_MC == IPV_MC_05_00_00_07)
    #define MC_ME_GS_S_SXOSC_MASK32                 ((uint32)0x00000100U)
    #define MC_ME_GS_S_SIRC_MASK32                  ((uint32)0x00000080U)
    #define MC_ME_GS_S_PLL0_MASK32                  ((uint32)0x00000040U)
    #define MC_ME_GS_S_FXOSC_MASK32                 ((uint32)0x00000020U)
    #define MC_ME_GS_S_FIRC_MASK32                  ((uint32)0x00000010U)
#endif /* (IPV_MC == IPV_MC_05_00_00_07) */

#if (IPV_MC == IPV_MC_06_00_00_10)
    #define MC_ME_GS_S_VIDEOPLL_MASK32                  ((uint32)0x00000400U)
    #define MC_ME_GS_S_DDRPLLDFS123_MASK32              ((uint32)0x00000200U)
    /** @violates @ref REG_ESYS_MC_ME_H_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define MC_ME_GS_S_ENETPLLDFS1234_MASK32            ((uint32)0x00000100U)
    #define MC_ME_GS_S_PERIPHPLL_MASK32                 ((uint32)0x00000080U)
    #define MC_ME_GS_S_ARMPLLDFS123_MASK32              ((uint32)0x00000040U)
    #define MC_ME_GS_S_XOSC_MASK32                      ((uint32)0x00000020U)
    #define MC_ME_GS_S_FIRC_MASK32                      ((uint32)0x00000010U)
#endif

