marshallma21/AUTOSAR_SampleProject_MPC5748G/plugins/Mcu_TS_T2D35M10I0R0/include/Reg_eSys_MC_ME.h
/* working values for sys clock */
#if ((IPV_MC == IPV_MC_04_03_00_00) || (IPV_MC == IPV_MC_04_06_05_00))
    #define MC_ME_GS_S_SYSCLK_SDPLL_U32             ((uint32)0x00000003U)
#endif

#if ((IPV_MC == IPV_MC_04_00_15_15) || (IPV_MC == IPV_MC_04_01_00_00) ||\
     (IPV_MC == IPV_MC_04_06_01_00) || (IPV_MC == IPV_MC_04_04_01_00) ||\
     (IPV_MC == IPV_MC_04_03_00_00) || (IPV_MC == IPV_MC_04_06_05_00) \
    )
    #define MC_ME_GS_S_SYSCLK_PLL1_U32              ((uint32)0x00000004U)
#endif

#if ((IPV_MC == IPV_MC_04_04_01_00) || (IPV_MC == IPV_MC_04_03_00_00) ||\
     (IPV_MC == IPV_MC_04_00_15_15) || (IPV_MC == IPV_MC_04_01_00_00) ||\
     (IPV_MC == IPV_MC_04_06_01_00) || (IPV_MC == IPV_MC_04_06_05_00) \
    )
    #define MC_ME_GS_S_SYSCLK_PLL0_U32              ((uint32)0x00000002U)
    #define MC_ME_GS_S_SYSCLK_XOSC_U32              ((uint32)0x00000001U)
    #define MC_ME_GS_S_SYSCLK_IRCOSC_U32            ((uint32)0x00000000U)
#endif /* IPV_MC == IPV_MC_04_03_00_00 */
#if (IPV_MC == IPV_MC_05_00_00_10)
    #define MC_ME_GS_S_SYSCLK_DISABLED              ((uint32)0x0000000FU)
    #define MC_ME_GS_S_SYSCLK_PLL1                  ((uint32)0x00000005U)
    #define MC_ME_GS_S_SYSCLK_PLL0                  ((uint32)0x00000004U)
    #define MC_ME_GS_S_SYSCLK_FXOSC                 ((uint32)0x00000001U)
    #define MC_ME_GS_S_SYSCLK_FIRC                  ((uint32)0x00000000U)
#endif /* (IPV_MC == IPV_MC_05_00_00_10) */

#if (IPV_MC == IPV_MC_05_00_00_07)
    #define MC_ME_GS_S_SYSCLK_DISABLED              ((uint32)0x0000000FU)
    #define MC_ME_GS_S_SYSCLK_PLL0                  ((uint32)0x00000002U)
    #define MC_ME_GS_S_SYSCLK_FXOSC                 ((uint32)0x00000001U)
    #define MC_ME_GS_S_SYSCLK_FIRC                  ((uint32)0x00000000U)
#endif /* (IPV_MC == IPV_MC_05_00_00_07) */

#if (IPV_MC == IPV_MC_06_00_00_10)
    #define MC_ME_GS_S_SYSCLK_DISABLED                  ((uint32)0x0000000FU)
    /** @violates @ref REG_ESYS_MC_ME_H_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define MC_ME_GS_S_SYSCLK_ARM_PLL_DFS_1_U32         ((uint32)0x00000002U)
    #define MC_ME_GS_S_SYSCLK_XOSC_U32                  ((uint32)0x00000001U)
    #define MC_ME_GS_S_SYSCLK_FIRC_U32                  ((uint32)0x00000000U)
#endif
/****************************************/
/* Power control for each run mode, common masks ((MC_ME_n_MC) */
/****************************************/
/* masks */
#define MC_ME_MODE_MC_PWRLVL_MASK32                 ((uint32)0x70000000U)
#define MC_ME_MODE_MC_PWRLVL_SHIFT32                ((uint32)28U)
#define MC_ME_MODE_MC_PDO_MASK32                    ((uint32)0x00800000U)
#define MC_ME_MODE_MC_MVRON_MASK32                  ((uint32)0x00100000U)
#define MC_ME_MODE_MC_FLAON_MASK32                  ((uint32)0x00030000U)

#if ((IPV_MC == IPV_MC_04_03_00_00) || (IPV_MC == IPV_MC_04_06_05_00))
    #define MC_ME_MODE_MC_SDPLLON_MASK32            ((uint32)0x00000100U)
#endif /* IPV_MC_04_03_00_00 */

#if ((IPV_MC == IPV_MC_04_04_01_00) || (IPV_MC == IPV_MC_04_03_00_00) ||\
     (IPV_MC == IPV_MC_04_00_15_15) || (IPV_MC == IPV_MC_04_01_00_00) ||\
     (IPV_MC == IPV_MC_04_06_01_00) || (IPV_MC == IPV_MC_04_06_05_00) \
    )
    #define MC_ME_MODE_MC_PLL1ON_MASK32             ((uint32)0x00000080U)
    #define MC_ME_MODE_MC_PLL0ON_MASK32             ((uint32)0x00000040U)
    #define MC_ME_MODE_MC_XOSCON_MASK32             ((uint32)0x00000020U)
    #define MC_ME_MODE_MC_IRCOSCON_MASK32           ((uint32)0x00000010U)
#elif (IPV_MC == IPV_MC_05_00_00_10)
    #define MC_ME_MODE_MC_PLL3ON_MASK32             ((uint32)0x00000800U)
    #define MC_ME_MODE_MC_PLL2ON_MASK32             ((uint32)0x00000400U)
    #define MC_ME_MODE_MC_PLL1ON_MASK32             ((uint32)0x00000200U)
    #define MC_ME_MODE_MC_PLL0ON_MASK32             ((uint32)0x00000100U)
    #define MC_ME_MODE_MC_SXOSCON_MASK32            ((uint32)0x00000080U)
    #define MC_ME_MODE_MC_SIRCON_MASK32             ((uint32)0x00000040U)
    #define MC_ME_MODE_MC_FXOSCON_MASK32            ((uint32)0x00000020U)
    #define MC_ME_MODE_MC_FIRCON_MASK32             ((uint32)0x00000010U)
#elif (IPV_MC == IPV_MC_05_00_00_07)
    #define MC_ME_MODE_MC_SXOSCON_MASK32            ((uint32)0x00000100U)
    #define MC_ME_MODE_MC_SIRCON_MASK32             ((uint32)0x00000080U)
    #define MC_ME_MODE_MC_PLL0ON_MASK32             ((uint32)0x00000040U)
    #define MC_ME_MODE_MC_FXOSCON_MASK32            ((uint32)0x00000020U)
    #define MC_ME_MODE_MC_FIRCON_MASK32             ((uint32)0x00000010U)
#elif (IPV_MC == IPV_MC_06_00_00_10)
    #define MC_ME_MODE_MC_VIDEOPLLON_MASK32         ((uint32)0x00000400U)
    /** @violates @ref REG_ESYS_MC_ME_H_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define MC_ME_MODE_MC_DDRPLLDFS123ON_MASK32     ((uint32)0x00000200U)
    /** @violates @ref REG_ESYS_MC_ME_H_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define MC_ME_MODE_MC_ENETPLLDFS1234ON_MASK32   ((uint32)0x00000100U)
    /** @violates @ref REG_ESYS_MC_ME_H_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define MC_ME_MODE_MC_PERIPHPLLON_MASK32        ((uint32)0x00000080U)
    /** @violates @ref REG_ESYS_MC_ME_H_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define MC_ME_MODE_MC_ARMPLLDFS123ON_MASK32     ((uint32)0x00000040U)
    #define MC_ME_MODE_MC_XOSCON_MASK32             ((uint32)0x00000020U)
    #define MC_ME_MODE_MC_FIRCON_MASK32             ((uint32)0x00000010U)
#endif /* (IPV_MC == IPV_MC_05_00_00_07) */

#define MC_ME_MODE_MC_SYSCLK_MASK32                 ((uint32)0x0000000FU)

/* working values */
#if ((IPV_MC == IPV_MC_04_03_00_00) || (IPV_MC == IPV_MC_04_06_05_00))
    #define MC_ME_MODE_MC_SYSCLK_SDPLL_U32          ((uint32)0x00000003U)
#endif

#if ((IPV_MC == IPV_MC_04_04_01_00) || (IPV_MC == IPV_MC_04_03_00_00) ||\
     (IPV_MC == IPV_MC_04_00_15_15) || (IPV_MC == IPV_MC_04_01_00_00) ||\
     (IPV_MC == IPV_MC_04_06_01_00) || (IPV_MC == IPV_MC_04_06_05_00) \
    )
    #define MC_ME_MODE_MC_SYSCLK_PLL1_U32           ((uint32)0x00000004U)
    #define MC_ME_MODE_MC_SYSCLK_PLL0_U32           ((uint32)0x00000002U)
    #define MC_ME_MODE_MC_SYSCLK_XOSC_U32           ((uint32)0x00000001U)
    #define MC_ME_MODE_MC_SYSCLK_IRCOSC_U32         ((uint32)0x00000000U)
#elif (IPV_MC == IPV_MC_05_00_00_10)
    #define MC_ME_MODE_MC_SYSCLK_PLL1_U32           ((uint32)0x00000005U)
    #define MC_ME_MODE_MC_SYSCLK_PLL0_U32           ((uint32)0x00000004U)
    #define MC_ME_MODE_MC_SYSCLK_FXOSC_U32          ((uint32)0x00000001U)
    #define MC_ME_MODE_MC_SYSCLK_FIRC_U32           ((uint32)0x00000000U)
#elif (IPV_MC == IPV_MC_05_00_00_07)
    #define MC_ME_MODE_MC_SYSCLK_PLL0_U32           ((uint32)0x00000002U)
    #define MC_ME_MODE_MC_SYSCLK_FXOSC_U32          ((uint32)0x00000001U)
    #define MC_ME_MODE_MC_SYSCLK_FIRC_U32           ((uint32)0x00000000U)
#elif (IPV_MC == IPV_MC_06_00_00_10)
    /** @violates @ref REG_ESYS_MC_ME_H_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define MC_ME_MODE_MC_SYSCLK_ARM_PLL_DFS1_U32   ((uint32)0x00000002U)
    #define MC_ME_MODE_MC_SYSCLK_XOSC_U32           ((uint32)0x00000001U)
    #define MC_ME_MODE_MC_SYSCLK_FIRC_U32           ((uint32)0x00000000U)
#endif /* (IPV_MC == IPV_MC_05_00_00_10) */
/* number of bytes used by the MC_ME_*_MC registers */
#define MC_ME_MODE_MC_REG_OFFSET_U32                ((uint32)0x0000004U)


/********************************************************/
/*  ME_IS[IMTC]: Mode transition complete interrupt.    */
/********************************************************/
/*
   This bit is set whenever the mode transition process completes (S_MTRANS transits from 1 to 0).
   This mode transition interrupt bit will not be set while entering low-power modes HALT0,
   or STOP0. */
#define MC_ME_IS_I_MTC_MASK32               ((uint32)0x00000001U)
/* ME_IS[ISAFE]: SAFE mode interrupt.
   This bit is set whenever the device enters SAFE mode on hardware requests generated in the
   system. */
#define MC_ME_IS_I_SAFE_MASK32              ((uint32)0x00000002U)
/* ME_IS[IMODE]: Invalid mode interrupt.
   This bit is set whenever an invalid mode transition is requested. */
#define MC_ME_IS_I_IMODE_MASK32             ((uint32)0x00000004U)
/* ME_IS[ICONF]: Invalid mode configuration interrupt.
   This bit is set whenever a write operation to ME_<mode>_MC registers with invalid mode
   configuration is attempted. */
#define MC_ME_IS_I_ICONF_MASK32             ((uint32)0x00000008U)
/* ME_IS[I_ICONF_CU]: Invalid mode configuration interrupt (Clock Usage).
   This bit is set during a mode transition if a clock which is required to be on by an enabled
   peripheral is configured to be turned off. */
#define MC_ME_IS_I_ICONF_CU_MASK32          ((uint32)0x00000010U)
/* ME_IS[I_ICONF_CC]: Invalid mode configuration interrupt (core configuration).
   This bit is set if a write access to one of the ME_CCTLn registers is attempted while a mode
   transition is in progress. */
#define MC_ME_IS_I_ICONF_CC_MASK32          ((uint32)0x00000020U)

/* ME_IS[I_ICONF_SCC]: Invalid Mode Configuration Interrupt (Secondary Clock Configuration).
   This bit is set if the source for any of the secondary sysclks have been configured to be turned off in the target mode. 
   This bit gets set when the MCTL register is written to with an invalid configuration and the mode transition 
   request is ignored */
#define MC_ME_IS_I_ICONF_SCC_MASK32          ((uint32)0x00000040U)

