marshallma21/AUTOSAR_SampleProject_MPC5748G/plugins/Mcu_TS_T2D35M10I0R0/include/Reg_eSys_MC_ME.h
/* mask to clear all enabled ISR's */
#define MC_ME_IS_I_CLEAR_MASK32             ((uint32)0x0000003FU)
/* mix all conf. ints into 1 */
#if ((IPV_MC == IPV_MC_04_04_01_00) || (IPV_MC == IPV_MC_04_03_00_00) ||\
     (IPV_MC == IPV_MC_04_00_15_15) || (IPV_MC == IPV_MC_04_01_00_00) ||\
     (IPV_MC == IPV_MC_04_06_01_00) || (IPV_MC == IPV_MC_04_06_05_00) \
    )
#define MC_ME_IS_I_CONF_ALL_MASK32          ( MC_ME_IS_I_ICONF_MASK32 | \
                                              MC_ME_IS_I_ICONF_CU_MASK32 | \
                                              MC_ME_IS_I_ICONF_CC_MASK32 \
                                            )
#elif ((IPV_MC == IPV_MC_05_00_00_07) || (IPV_MC == IPV_MC_05_00_00_10))
    #define MC_ME_IS_I_CONF_ALL_MASK32          ( MC_ME_IS_I_ICONF_MASK32 | MC_ME_IS_I_ICONF_CC_MASK32 )
#elif (IPV_MC == IPV_MC_06_00_00_10)
    #define MC_ME_IS_I_CONF_ALL_MASK32          ( MC_ME_IS_I_ICONF_SCC_MASK32 | MC_ME_IS_I_ICONF_MASK32 | \
                                                  MC_ME_IS_I_ICONF_CU_MASK32 | MC_ME_IS_I_ICONF_MASK32 | \
                                                  MC_ME_IS_I_IMODE_MASK32 \
                                                )
#endif

/********************************************************/
/*            Interrupt Mask Register (MC_ME_IM)        */
/********************************************************/
#define MC_ME_IM_M_MTC_MASK32               ((uint32)0x00000001U)
#define MC_ME_IM_M_SAFE_MASK32              ((uint32)0x00000002U)
#define MC_ME_IM_M_IMODE_MASK32             ((uint32)0x00000004U)
#define MC_ME_IM_M_ICONF_MASK32             ((uint32)0x00000008U)
#define MC_ME_IM_M_ICONF_CU_MASK32          ((uint32)0x00000010U)
#define MC_ME_IM_M_ICONF_CC_MASK32          ((uint32)0x00000020U)
#define MC_ME_IM_M_ICONF_SCC_MASK32         ((uint32)0x00000040U)

#if ((IPV_MC == IPV_MC_04_04_01_00) || (IPV_MC == IPV_MC_04_03_00_00) ||\
     (IPV_MC == IPV_MC_04_00_15_15) || (IPV_MC == IPV_MC_04_01_00_00) ||\
     (IPV_MC == IPV_MC_04_06_01_00) || (IPV_MC == IPV_MC_04_06_05_00) \
    )
#define MC_ME_IM_M_ICONF_ALL_MASK32         ( MC_ME_IM_M_ICONF_MASK32 | \
                                              MC_ME_IM_M_ICONF_CU_MASK32 | \
                                              MC_ME_IM_M_ICONF_CC_MASK32 \
                                            )
#elif ((IPV_MC == IPV_MC_05_00_00_07) || (IPV_MC == IPV_MC_05_00_00_10))
    #define MC_ME_IM_M_ICONF_ALL_MASK32         ( MC_ME_IM_M_ICONF_MASK32 | MC_ME_IM_M_ICONF_CC_MASK32 )
#elif (IPV_MC == IPV_MC_06_00_00_10)
    #define MC_ME_IM_M_ICONF_ALL_MASK32         ( MC_ME_IM_M_ICONF_SCC_MASK32 | MC_ME_IM_M_ICONF_CC_MASK32 | \
                                                  MC_ME_IM_M_ICONF_CU_MASK32 | MC_ME_IM_M_ICONF_MASK32 | \
                                                  MC_ME_IM_M_IMODE_MASK32 \
                                                )
#endif
/********************************************************/
/* Invalid Mode Transition Status Register (MC_ME_IMTS) */
/********************************************************/
#if (IPV_MC == IPV_MC_06_00_00_10)
    #define MC_ME_IMTS_MASK32                   ((uint32)0x0000001EU)
#else
    #define MC_ME_IMTS_MASK32                   ((uint32)0x0000003FU)
#endif

/* ME_IMTS[SEA] field: SAFE Event Active status.
  This bit is set whenever the device is in SAFE mode, SAFE event bit is pending and a new mode
  requested other than RESET/SAFE modes. */
#define MC_ME_IMTS_S_SEA_MASK32             ((uint32)0x00000001U)
/* ME_IMTS[NMA] field: Non-existing Mode Access status.
   This bit is set whenever the target mode requested is one of those non existing modes determined
   by ME_ME register. */
#define MC_ME_IMTS_S_NMA_MASK32             ((uint32)0x00000002U)
/* ME_IMTS[DMA] field: Disabled Mode Access status.
  This bit is set whenever the target mode requested is one of those disabled modes determined by
  ME_ME register. */
#define MC_ME_IMTS_S_DMA_MASK32             ((uint32)0x00000004U)
/* ME_IMTS[MRI] field: Mode Request Illegal status.
  This bit is set whenever the target mode requested is not a valid mode with respect to current
  mode. */
#define MC_ME_IMTS_S_MRI_MASK32             ((uint32)0x00000008U)
/* ME_IMTS[MTI] field: Mode Transition Illegal status.
   This bit is set whenever a new mode is requested while some other mode transition process is
   active (S_MTRANS is '1'). */
#define MC_ME_IMTS_S_MTI_MASK32             ((uint32)0x00000010U)
/* Mode Request Ignored Status */
#define MC_ME_IMTS_S_MRIG_MASK32            ((uint32)0x00000020U)

#define MC_ME_IMTS_S_CLEAR_MASK32           ((uint32)0x0000003FU)


/********************************************************/
/*                      ME_ME: ME_RESET_MC              */
/********************************************************/
/* ME_ME: ME_RESET_MC register - Mask for the writable allowed bits. */
#if ((IPV_MC == IPV_MC_04_04_01_00) || (IPV_MC == IPV_MC_04_00_15_15) || \
     (IPV_MC == IPV_MC_04_01_00_00) || (IPV_MC == IPV_MC_04_03_00_00) || \
     (IPV_MC == IPV_MC_04_06_05_00) || (IPV_MC == IPV_MC_05_00_00_10) || \
     (IPV_MC == IPV_MC_05_00_00_07) || (IPV_MC == IPV_MC_06_00_00_10) || \
     (IPV_MC == IPV_MC_04_06_01_00) \
    )
    #define MC_ME_RESET_MC_WRBITS_MASK32            ((uint32)0x00000000U)
#endif /* (IPV_MC == IPV_MC_04_03_00_00) */

#if ((IPV_MC == IPV_MC_04_04_01_00) || (IPV_MC == IPV_MC_04_00_15_15) || \
     (IPV_MC == IPV_MC_04_01_00_00) || (IPV_MC == IPV_MC_04_03_00_00) || \
     (IPV_MC == IPV_MC_04_06_05_00) || (IPV_MC == IPV_MC_04_06_01_00) \
    )
    #define MC_ME_RESET_MC_RESBITS_MASK32           ((uint32)0x00130010U)
#elif (IPV_MC == IPV_MC_05_00_00_10)
    #define MC_ME_RESET_MC_RESBITS_MASK32           ((uint32)0x00130050U)
#elif (IPV_MC == IPV_MC_05_00_00_07)
    #define MC_ME_RESET_MC_RESBITS_MASK32           ((uint32)0x00130090U)
#elif (IPV_MC == IPV_MC_06_00_00_10)
    #define MC_ME_RESET_MC_RESBITS_MASK32           ((uint32)0x00100010U)
#endif


/********************************************************/
/*                      ME_ME: ME_TEST_MC               */
/********************************************************/
/* ME_ME: ME_TEST_MC register - Mask for the writable allowed bits. */
#if ((IPV_MC == IPV_MC_04_04_01_00) || (IPV_MC == IPV_MC_04_00_15_15) || \
     (IPV_MC == IPV_MC_04_01_00_00) || (IPV_MC == IPV_MC_04_06_01_00) \
    )
    #define MC_ME_TEST_MC_WRBITS_MASK32             ((uint32)0x708300FFU)
#elif ((IPV_MC == IPV_MC_04_03_00_00) || (IPV_MC == IPV_MC_04_06_05_00))
    #define MC_ME_TEST_MC_WRBITS_MASK32             ((uint32)0x00000000U)
#elif (IPV_MC == IPV_MC_06_00_00_10)
    #define MC_ME_TEST_MC_WRBITS_MASK32             ((uint32)0x708007EFU)
#endif
#if ((IPV_MC == IPV_MC_04_03_00_00) || (IPV_MC == IPV_MC_04_06_05_00))
    #define MC_ME_TEST_MC_RESBITS_MASK32            ((uint32)0x00100010U)
#elif ((IPV_MC == IPV_MC_04_00_15_15) || (IPV_MC == IPV_MC_04_01_00_00) || \
       (IPV_MC == IPV_MC_04_06_01_00) || (IPV_MC == IPV_MC_04_04_01_00) \
      )
    #define MC_ME_TEST_MC_RESBITS_MASK32            ((uint32)0x00100000U)
#else
    #define MC_ME_TEST_MC_RESBITS_MASK32            ((uint32)0x00000000U)
#endif /* (IPV_MC == IPV_MC_04_04_01_00) */


/********************************************************/
/*                      ME_ME: ME_SAFE_MC               */
/********************************************************/
/* ME_ME: ME_SAFE_MC register - Mask for the writable allowed bits. */
#if ((IPV_MC == IPV_MC_04_04_01_00) || (IPV_MC == IPV_MC_04_00_15_15) || \
     (IPV_MC == IPV_MC_04_01_00_00) || (IPV_MC == IPV_MC_04_03_00_00) \
    )
    #define MC_ME_SAFE_MC_WRBITS_MASK32             ((uint32)0x00800000U)
#elif ((IPV_MC == IPV_MC_04_06_01_00) || (IPV_MC == IPV_MC_05_00_00_10) || \
       (IPV_MC == IPV_MC_05_00_00_07) || (IPV_MC == IPV_MC_04_06_05_00) \
      )
    #define MC_ME_SAFE_MC_WRBITS_MASK32             ((uint32)0x70800000U)
#endif
#if ((IPV_MC == IPV_MC_04_04_01_00) || (IPV_MC == IPV_MC_04_00_15_15) || \
     (IPV_MC == IPV_MC_04_01_00_00) || (IPV_MC == IPV_MC_04_03_00_00) || \
     (IPV_MC == IPV_MC_04_06_01_00) || (IPV_MC == IPV_MC_05_00_00_10) || \
     (IPV_MC == IPV_MC_05_00_00_07) \
    )
    #define MC_ME_SAFE_MC_RESBITS_MASK32            ((uint32)0x00130010U)
#elif (IPV_MC == IPV_MC_04_06_05_00)
    #define MC_ME_SAFE_MC_RESBITS_MASK32            ((uint32)0x00000000U)
#endif 


/********************************************************/
/*                  ME_ME: ME_DRUN_MC                   */
/********************************************************/
/* ME_ME: ME_DRUN_MC register - Mask for the writable allowed bits. */
#if ((IPV_MC == IPV_MC_04_04_01_00) || (IPV_MC == IPV_MC_04_00_15_15) || \
     (IPV_MC == IPV_MC_04_01_00_00) || (IPV_MC == IPV_MC_04_06_01_00) \
    )
    #define MC_ME_DRUN_MC_WRBITS_MASK32             ((uint32)0x700300EFU)
#elif ((IPV_MC == IPV_MC_04_03_00_00) || (IPV_MC == IPV_MC_04_06_05_00))
    #define MC_ME_DRUN_MC_WRBITS_MASK32             ((uint32)0x700301EFU)
#elif (IPV_MC == IPV_MC_05_00_00_10)
    #define MC_ME_DRUN_MC_WRBITS_MASK32             ((uint32)0x70030FEFU)
#elif (IPV_MC == IPV_MC_05_00_00_07)
    #define MC_ME_DRUN_MC_WRBITS_MASK32             ((uint32)0x700301EFU)
#elif (IPV_MC == IPV_MC_06_00_00_10)
    #define MC_ME_DRUN_MC_WRBITS_MASK32             ((uint32)0x700007EFU)
#endif /* (IPV_MC == IPV_MC_04_04_01_00) */

