marshallma21/AUTOSAR_SampleProject_MPC5748G/plugins/Mcu_TS_T2D35M10I0R0/include/Reg_eSys_MC_ME.h
#if (IPV_MC == IPV_MC_06_00_00_10)
    #define MC_ME_DRUN_MC_RESBITS_MASK32                ((uint32)0x00000000U)
#else
    #define MC_ME_DRUN_MC_RESBITS_MASK32                ((uint32)0x00100010U)
#endif
/********************************************************/
/*                  ME_ME: ME_RUN0_3_MC                 */
/********************************************************/
/* ME_ME: ME_RUN0_3_MC register - Mask for the writable allowed bits. */
#if ((IPV_MC == IPV_MC_04_04_01_00) || (IPV_MC == IPV_MC_04_00_15_15) || \
     (IPV_MC == IPV_MC_04_01_00_00) || (IPV_MC == IPV_MC_04_06_01_00) \
    )
    #define MC_ME_RUN0_3_MC_WRBITS_MASK32           ((uint32)0x700300EFU)
#elif ((IPV_MC == IPV_MC_04_03_00_00) || (IPV_MC == IPV_MC_04_06_05_00) || \
       (IPV_MC == IPV_MC_05_00_00_07) \
      )
    #define MC_ME_RUN0_3_MC_WRBITS_MASK32           ((uint32)0x700301EFU)
#elif (IPV_MC == IPV_MC_05_00_00_10)
    #define MC_ME_RUN0_3_MC_WRBITS_MASK32           ((uint32)0x70030FEFU)
#elif (IPV_MC == IPV_MC_06_00_00_10)
    #define MC_ME_RUN0_3_MC_WRBITS_MASK32           ((uint32)0x700007EFU)
#endif

#if ((IPV_MC == IPV_MC_04_04_01_00) || (IPV_MC == IPV_MC_04_00_15_15) || \
     (IPV_MC == IPV_MC_04_01_00_00) || (IPV_MC == IPV_MC_04_06_01_00) || \
     (IPV_MC == IPV_MC_04_03_00_00) || (IPV_MC == IPV_MC_04_06_05_00) || \
     (IPV_MC == IPV_MC_05_00_00_10) \
    )
    #define MC_ME_RUN0_3_MC_RESBITS_MASK32          ((uint32)0x00100010U)
#elif (IPV_MC == IPV_MC_06_00_00_10)
    #define MC_ME_RUN0_3_MC_RESBITS_MASK32          ((uint32)0x00000000U)
#elif (IPV_MC == IPV_MC_05_00_00_07)
    #define MC_ME_RUN0_3_MC_RESBITS_MASK32          ((uint32)0x00100010U)
#endif /* (IPV_MC == IPV_MC_04_04_01_00) */


/********************************************************/
/*                  ME_ME: ME_HALT0_MC                  */
/********************************************************/
/* ME_ME: ME_HALT0_MC register - Mask for the writable allowed bits. */
#if ((IPV_MC == IPV_MC_04_04_01_00) || (IPV_MC == IPV_MC_04_00_15_15) || \
     (IPV_MC == IPV_MC_04_01_00_00) || (IPV_MC == IPV_MC_04_06_01_00) \
    )
    #define MC_ME_HALT0_MC_WRBITS_MASK32            ((uint32)0x000300EFU)
#elif ((IPV_MC == IPV_MC_04_03_00_00) || (IPV_MC == IPV_MC_04_06_05_00))
    #define MC_ME_HALT0_MC_WRBITS_MASK32            ((uint32)0x000301EFU)
#endif /* (IPV_MC == IPV_MC_04_04_01_00) */
#if ((IPV_MC == IPV_MC_04_04_01_00) || (IPV_MC == IPV_MC_04_00_15_15) || \
     (IPV_MC == IPV_MC_04_01_00_00) || (IPV_MC == IPV_MC_04_06_01_00) || \
     (IPV_MC == IPV_MC_04_03_00_00) || (IPV_MC == IPV_MC_04_06_05_00) \
    )
    #define MC_ME_HALT0_MC_RESBITS_MASK32           ((uint32)0x00100010U)
#else
    #define MC_ME_HALT0_MC_RESBITS_MASK32           ((uint32)0x00000000U)
#endif /* (IPV_MC == IPV_MC_04_04_01_00) */


/********************************************************/
/*              ME_ME: ME_STOP0_MC                      */
/********************************************************/
/* ME_ME: ME_STOP0_MC register - Mask for the writable allowed bits. */
#if ((IPV_MC == IPV_MC_04_04_01_00) || (IPV_MC == IPV_MC_04_00_15_15) ||\
     (IPV_MC == IPV_MC_04_01_00_00) || (IPV_MC == IPV_MC_04_03_00_00) ||\
     (IPV_MC == IPV_MC_04_06_05_00) \
    )
    #define MC_ME_STOP0_MC_WRBITS_MASK32            ((uint32)0x00830020U)
#elif (IPV_MC == IPV_MC_05_00_00_10)
    #define MC_ME_STOP0_MC_WRBITS_MASK32            ((uint32)0x008300FFU)
#elif (IPV_MC == IPV_MC_04_06_01_00)
    #define MC_ME_STOP0_MC_WRBITS_MASK32            ((uint32)0x0083002FU)
#elif (IPV_MC == IPV_MC_05_00_00_07)
    #define MC_ME_STOP0_MC_WRBITS_MASK32            ((uint32)0x009301BFU)
#endif /* (IPV_MC == IPV_MC_04_04_01_00) */
#if ((IPV_MC == IPV_MC_04_04_01_00) || (IPV_MC == IPV_MC_04_00_15_15) ||\
     (IPV_MC == IPV_MC_04_01_00_00) || (IPV_MC == IPV_MC_04_03_00_00) ||\
     (IPV_MC == IPV_MC_04_06_05_00) || (IPV_MC == IPV_MC_04_06_01_00) \
    )
    #define MC_ME_STOP0_MC_RESBITS_MASK32           ((uint32)0x00100010U)
#elif (IPV_MC == IPV_MC_05_00_00_10)
    #define MC_ME_STOP0_MC_RESBITS_MASK32           ((uint32)0x00100000U)
#elif (IPV_MC == IPV_MC_05_00_00_07)
    #define MC_ME_STOP0_MC_RESBITS_MASK32           ((uint32)0x00000000U)
#endif /* (IPV_MC == IPV_MC_04_04_01_00) */


/********************************************************/
/*              ME_ME: ME_STANDBY0_MC                   */
/********************************************************/
#if (IPV_MC == IPV_MC_05_00_00_10)
    #define MC_ME_STBY0_MC_WRBITS_MASK32                ((uint32)0x000000F0U)
#elif (IPV_MC == IPV_MC_05_00_00_07)
    #define MC_ME_STBY0_MC_WRBITS_MASK32                ((uint32)0x000001B0U)
#endif

#if ((IPV_MC == IPV_MC_05_00_00_10) || (IPV_MC == IPV_MC_05_00_00_07))
    #define MC_ME_STBY0_MC_RESBITS_MASK32               ((uint32)0x0081000FU)
#endif


/********************************************************/
/*              ME_ME: ME_MCTL[KEY]                     */
/********************************************************/
/* ME_MCTL[KEY] field: Control key - These bits enable write access to this register. */
#define MC_ME_MCTL_DIRECT_KEY_U32                   ((uint32)0x00005AF0U)
/* ME_MCTL[KEY] field: Read access will always return inverted key. */
#define MC_ME_MCTL_INVERTED_KEY_U32                 ((uint32)0x0000A50FU)


#define MC_ME_PS_OFFSET_U32                         ((uint32)0x00000004U)


/********************************************************/
/*  Mode Enable Register (ME_ME) masks and defines      */
/********************************************************/
#if ((IPV_MC == IPV_MC_04_04_01_00) || (IPV_MC == IPV_MC_04_00_15_15) ||\
     (IPV_MC == IPV_MC_04_01_00_00) || (IPV_MC == IPV_MC_04_03_00_00) ||\
     (IPV_MC == IPV_MC_04_06_01_00) || (IPV_MC == IPV_MC_04_06_05_00) \
    )
    #define MC_ME_ME_WRBITS_MASK32                  ((uint32)0x000005E2U)
    #define MC_ME_ME_RESBITS_MASK32                 ((uint32)0x0000801DU)
#elif ((IPV_MC == IPV_MC_05_00_00_10) || (IPV_MC == IPV_MC_05_00_00_07))
    #define MC_ME_ME_WRBITS_MASK32                  ((uint32)0x000024E0U)
    #define MC_ME_ME_RESBITS_MASK32                 ((uint32)0x0000801DU)
#elif (IPV_MC == IPV_MC_06_00_00_10)
    #define MC_ME_ME_WRBITS_MASK32                  ((uint32)0x000000E2U)
    #define MC_ME_ME_RESBITS_MASK32                 ((uint32)0x00000000U)
#endif

#if ((IPV_MC == IPV_MC_05_00_00_10) || (IPV_MC == IPV_MC_05_00_00_07))
    #define MC_ME_ME_STBY0_MASK32                   ((uint32)0x00002000U)
#endif 

#define MC_ME_ME_STOP0_MASK32                       ((uint32)0x00000400U)
#define MC_ME_ME_HALT0_MASK32                       ((uint32)0x00000100U)
#define MC_ME_ME_RUN3_MASK32                        ((uint32)0x00000080U)
#define MC_ME_ME_RUN2_MASK32                        ((uint32)0x00000040U)
#define MC_ME_ME_RUN1_MASK32                        ((uint32)0x00000020U)
#define MC_ME_ME_TEST_MASK32                        ((uint32)0x00000002U)


/********************************************************/
/* Interrupt Mask Register (ME_IM) mask and defines     */
/********************************************************/
#define MC_ME_IM_WRBITS_MASK32                      ((uint32)0x0000003FU)
#define MC_ME_IM_RESBITS_MASK32                     ((uint32)0x00000000U)

#define MC_ME_IM_ICONF_SCC_MASK32                   ((uint32)0x00000040U)
#define MC_ME_IM_ICONF_CC_MASK32                    ((uint32)0x00000020U)
#define MC_ME_IM_ICONF_CU_MASK32                    ((uint32)0x00000010U)
#define MC_ME_IM_ICONF_MASK32                       ((uint32)0x00000008U)
#define MC_ME_IM_IMODE_MASK32                       ((uint32)0x00000004U)
#define MC_ME_IM_SAFE_MASK32                        ((uint32)0x00000002U)
#define MC_ME_IM_MTC_MASK32                         ((uint32)0x00000001U)


/********************************************************/
/*          Core Control Register (ME_CCTLn)            */
/********************************************************/
#if ((IPV_MC == IPV_MC_04_03_00_00) || (IPV_MC == IPV_MC_04_00_15_15) ||\
     (IPV_MC == IPV_MC_04_01_00_00) || (IPV_MC == IPV_MC_04_06_01_00) ||\
     (IPV_MC == IPV_MC_04_06_05_00) \
    )
    #define MC_ME_CCTL_RWBITS_MASK16                ((uint16)0x00FEU)
#elif ((IPV_MC == IPV_MC_05_00_00_10) || (IPV_MC == IPV_MC_05_00_00_07))
    #define MC_ME_CCTL_RWBITS_MASK16                ((uint16)0x00FCU)
#elif (IPV_MC == IPV_MC_06_00_00_10)
    #define MC_ME_CCTL_RWBITS_MASK16                ((uint16)0x00FAU)
#endif

