marshallma21/AUTOSAR_SampleProject_MPC5748G/plugins/Mcu_TS_T2D35M10I0R0/include/Reg_eSys_MC_ME.h
#define MC_ME_CCTL_RESBITS_MASK16                   ((uint16)0x0000U)
#if ((IPV_MC == IPV_MC_05_00_00_10) || (IPV_MC == IPV_MC_05_00_00_07))
#define MC_ME_CCTL_STBY_MASK16                      ((uint16)0x2000U)
#endif
#define MC_ME_CCTL_RUN3_MASK16                      ((uint16)0x0080U)
#define MC_ME_CCTL_RUN2_MASK16                      ((uint16)0x0040U)
#define MC_ME_CCTL_RUN1_MASK16                      ((uint16)0x0020U)
#define MC_ME_CCTL_RUN0_MASK16                      ((uint16)0x0010U)
#define MC_ME_CCTL_DRUN_MASK16                      ((uint16)0x0008U)
#define MC_ME_CCTL_SAFE_MASK16                      ((uint16)0x0004U)
#define MC_ME_CCTL_TEST_MASK16                      ((uint16)0x0002U)

#define MC_ME_CCTL_UNUSED_MASK16                    ((uint16)0xFFFFU)

/********************************************************/
/*      Core Control Register (ME_CADDRn)               */
/********************************************************/
#define MC_ME_CADDR_RWBITS_MASK32                   ((uint32)0xFFFFFFFDU)
#define MC_ME_CADDR_RESBITS_MASK32                  ((uint32)0x00000000U)

#define MC_ME_CADDR_ADDR_MASK32                     ((uint32)0xFFFFFFFCU)
#define MC_ME_CADDR_RMC_MASK32                      ((uint32)0x00000001U)

#if (IPV_MC == IPV_MC_06_00_00_10)
    #define MC_ME_CADDR_ADDR_EN_MASK32              ((uint32)0x00000001U)
#endif

/*****************************************************************************/
/*  <MODE> Secondary Clock Configuration Register (MC_ME_<MODE>_SEC_CC_I)   */
/****************************************************************************/
#define MC_ME_MODE_SEC_CC_I_PWRLVL3_MASK32                 ((uint32)0x70000000U)
#define MC_ME_MODE_SEC_CC_I_PWRLVL3_SHIFT32                ((uint32)28U)

#define MC_ME_MODE_SEC_CC_I_PWRLVL2_MASK32                 ((uint32)0x07000000U)
#define MC_ME_MODE_SEC_CC_I_PWRLVL2_SHIFT32                ((uint32)24U)

#define MC_ME_MODE_SEC_CC_I_PWRLVL1_MASK32                 ((uint32)0x00700000U)
#define MC_ME_MODE_SEC_CC_I_PWRLVL1_SHIFT32                ((uint32)20U)

#define MC_ME_MODE_SEC_CC_I_SYSCLK3_MASK32                 ((uint32)0x0000F000U)
#define MC_ME_MODE_SEC_CC_I_SYSCLK3_SHIFT32                ((uint32)12U)

#define MC_ME_MODE_SEC_CC_I_SYSCLK2_MASK32                 ((uint32)0x00000F00U)
#define MC_ME_MODE_SEC_CC_I_SYSCLK2_SHIFT32                ((uint32)8U)

#define MC_ME_MODE_SEC_CC_I_SYSCLK1_MASK32                 ((uint32)0x000000F0U)
#define MC_ME_MODE_SEC_CC_I_SYSCLK1_SHIFT32                ((uint32)4U)

/** @violates @ref REG_ESYS_MC_ME_H_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
#define MC_ME_MODE_SEC_CC_I_SYSCLK3_ARM_PLL_DFS3_U32    ((uint32)0x00002000U)
/** @violates @ref REG_ESYS_MC_ME_H_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
#define MC_ME_MODE_SEC_CC_I_SYSCLK3_XOSC_U32            ((uint32)0x00001000U)
/** @violates @ref REG_ESYS_MC_ME_H_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
#define MC_ME_MODE_SEC_CC_I_SYSCLK3_FIRC_U32            ((uint32)0x00000000U)
    
/** @violates @ref REG_ESYS_MC_ME_H_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
#define MC_ME_MODE_SEC_CC_I_SYSCLK2_ARM_PLL_DFS2_U32    ((uint32)0x00000200U)
/** @violates @ref REG_ESYS_MC_ME_H_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
#define MC_ME_MODE_SEC_CC_I_SYSCLK2_XOSC_U32            ((uint32)0x00000100U)
/** @violates @ref REG_ESYS_MC_ME_H_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
#define MC_ME_MODE_SEC_CC_I_SYSCLK2_FIRC_U32            ((uint32)0x00000000U)

/** @violates @ref REG_ESYS_MC_ME_H_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
#define MC_ME_MODE_SEC_CC_I_SYSCLK1_ARM_PLL_U32         ((uint32)0x00000020U)
/** @violates @ref REG_ESYS_MC_ME_H_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
#define MC_ME_MODE_SEC_CC_I_SYSCLK1_XOSC_U32            ((uint32)0x00000010U)
/** @violates @ref REG_ESYS_MC_ME_H_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
#define MC_ME_MODE_SEC_CC_I_SYSCLK1_FIRC_U32            ((uint32)0x00000000U)

/** @violates @ref REG_ESYS_MC_ME_H_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
#define MC_ME_MODE_SEC_CC_I_ALL_SYSCLKS_MASK32          (MC_ME_MODE_SEC_CC_I_SYSCLK3_MASK32 | \
                                                         MC_ME_MODE_SEC_CC_I_SYSCLK2_MASK32 | \
                                                         MC_ME_MODE_SEC_CC_I_SYSCLK1_MASK32 \
                                                        )

#ifdef MCU_ERR009139_IPV_MC_05000007
#if (MCU_ERR009139_IPV_MC_05000007 == STD_ON)
/*****************************************************************************/
/*  GPR SLEEP Register (GPR_SLEEP)   */
/****************************************************************************/
#define MC_ME_GPR_SLEEP_RWBITS_MASK32                   ((uint32)0x00000043U)
#define MC_ME_GPR_SLEEP_RESBITS_MASK32                  ((uint32)0x00000000U)

#define MC_ME_GPR_SLEEP_ENABLE_U32                      ((uint32)0x00000043U)

#define MC_ME_GPR_SLEEP_DEFAULT_U32                     ((uint32)0x00000000U)

#endif  /* MCU_ERR009139_IPV_MC_05000007 */
#endif  /* (MCU_ERR009139_IPV_MC_05000007 == STD_ON) */

/*==================================================================================================
*                                             ENUMS
==================================================================================================*/


/*==================================================================================================
*                                STRUCTURES AND OTHER TYPEDEFS
==================================================================================================*/


/*==================================================================================================
*                                GLOBAL VARIABLE DECLARATIONS
==================================================================================================*/


/*==================================================================================================
*                                    FUNCTION PROTOTYPES
==================================================================================================*/


#ifdef __cplusplus
}
#endif

#endif /* REG_ESYS_MC_ME_H */

/** @} */
